---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut.TopCutHeight
source: html/7d94c048-7f1f-847b-ba1f-50029a5ae947.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangleCut.TopCutHeight Property

Section height right Cut.

## Syntax (C#)
```csharp
public double TopCutHeight { get; set; }
```